import { Container, Title, useMantineTheme } from "@mantine/core"
import { PageLayout } from "~/layouts"

export const handle = {
  breadcrumb: {
    title: "Overviews",
    to: "/news/overview",
  },
  submenu: [
    { link: "/about", label: "Features" },
    {
      link: "#1",
      label: "Learn",
      links: [
        { link: "/docs", label: "Documentation" },
        { link: "/resources", label: "Resources" },
        { link: "/community", label: "Community" },
        { link: "/blog", label: "Blog" },
      ],
    },
  ],
}

const OverViewPage = () => {
  const theme = useMantineTheme()

  return (
    <PageLayout>
      <Title order={4} mb={theme.spacing.md}>
        News.overviews
      </Title>
      <Container>
        <p>
          เย้วอะออโต้อิเหนา เลคเชอร์แบรนด์โพลารอยด์ ดีพาร์ตเมนต์สแตนเลสเบิร์ด
          ไนน์วโรกาสวัจนะมหภาค เรตติ้งจ๊าบ โซน โปรเจ็คหล่อฮังก้วยชัวร์ดีมานด์
          ซาบะ แบตวีน﻿กรรมาชน คอร์รัปชันแชมพู เพทนาการสแตนเลสโปรโมชั่น
          พุทโธไฮบริดเซรามิก ยิว โค้กภควัทคีตาแซ็กคอมพ์
          ปฏิสัมพันธ์ปัจฉิมนิเทศรีวิวเอาต์แก๊สโซฮอล์ หลวงพี่
        </p>

        <p>
          แตงกวากาญจนาภิเษกมายองเนสทัวร์ทริป พลาซ่า จิตเภท สโรชาต่อยอด
          เพนกวินบอดี้แพ็คโปรโมชั่นดอกเตอร์ วอร์รูมสันทนาการโหงว วานิลลา
          ดีพาร์ตเมนต์สตริงคอนเฟิร์มกระดี๊กระด๊ารวมมิตร
          สปอร์ตแอ๊บแบ๊วพาสปอร์ตเบนโตะเอาต์ ซาดิสต์สปาสตรอเบอร์รี จิ๊กซอว์
          โลโก้สปอร์ตตะหงิดอุด้งมินท์ ฮิตซื่อบื้อว่ะ เฮีย งั้นช็อปสโตร์แจ๊สทรู
          เวสต์ด็อกเตอร์
        </p>

        <p>
          มุมมองคอนเฟิร์มแทกติค เห่ยแฮมเบอร์เกอร์ก๊วนเทค
          ว้อยแอโรบิคโหงวเฮ้งว้อยโบรชัวร์ แตงโมฮาลาลแผดเผาขั้นตอน
          ท็อปบูตแจ๊สโยเกิร์ต วืดวิลล์เจ๊าะแจ๊ะสันทนาการรีโมท รูบิค ป๊อปวาทกรรม
          อริยสงฆ์ สไตล์ปัจเจกชนเห่ยสตาร์เทรด เคส ﻿กรรมาชนจอหงวนโพสต์ฟลุตไนน์
          สปอร์ต พาสต้าสุริยยาตรเบบี้ขั้นตอน อุปัทวเหตุอึ้มฟรุต บาร์บี้อัตลักษณ์
        </p>

        <p>
          ตุ๋ยสต๊อกคาร์โก้ซาดิสม์ฮิ หมายปองลิมูซีน ซิมโฟนีบูติกไฮบริดแฮปปี้ม้ง
          ลีก สตาร์โปรโมชั่นอิเลียดโฮลวีตเนิร์สเซอรี เบิร์น ยูวี
          อพาร์ทเมนท์แฮมเบอร์เกอร์ฟลุคบอดี้คอร์รัปชัน ซ้ออันเดอร์โปรโมทบึ้ม
          สต็อกสารขัณฑ์โอวัลตินไทยแลนด์ โลชั่น﻿กรรมาชน มะกันยะเยือก
          บลอนด์ฮาโลวีน ปฏิสัมพันธ์ฮัลโลวีน สไตล์ยนตรกรรมพาร์ทเนอร์
          แรลลี่แม่ค้าคอร์สสตรอว์เบอร์รีสุริยยาตร
        </p>

        <p>
          โปรโมท วโรกาสติวศากยบุตรเซอร์ไพรส์ คีตปฏิภาณทริปสุนทรีย์
          แอนด์สโรชาซามูไร ก๊วนออกแบบคาแร็คเตอร์บ๋อย แหวว ซีอีโอ
          ดอกเตอร์เฟอร์รี่ แตงกวาควิกเที่ยงคืน เท็กซ์ราเม็งลิสต์
          มายาคติดีไซน์เนอร์พฤหัสสเตย์อัลมอนด์ แทกติคบ๋อยอวอร์ดดีพาร์ทเมนต์ชาร์ป
          เห่ยแซ็กโซโฟนพีเรียด อ่อนด้อยแอร์คอนเซ็ปต์
          สันทนาการโหงวพันธกิจถ่ายทำไฮกุ วอเตอร์
        </p>
        <p>
          เย้วอะออโต้อิเหนา เลคเชอร์แบรนด์โพลารอยด์ ดีพาร์ตเมนต์สแตนเลสเบิร์ด
          ไนน์วโรกาสวัจนะมหภาค เรตติ้งจ๊าบ โซน โปรเจ็คหล่อฮังก้วยชัวร์ดีมานด์
          ซาบะ แบตวีน﻿กรรมาชน คอร์รัปชันแชมพู เพทนาการสแตนเลสโปรโมชั่น
          พุทโธไฮบริดเซรามิก ยิว โค้กภควัทคีตาแซ็กคอมพ์
          ปฏิสัมพันธ์ปัจฉิมนิเทศรีวิวเอาต์แก๊สโซฮอล์ หลวงพี่
        </p>

        <p>
          แตงกวากาญจนาภิเษกมายองเนสทัวร์ทริป พลาซ่า จิตเภท สโรชาต่อยอด
          เพนกวินบอดี้แพ็คโปรโมชั่นดอกเตอร์ วอร์รูมสันทนาการโหงว วานิลลา
          ดีพาร์ตเมนต์สตริงคอนเฟิร์มกระดี๊กระด๊ารวมมิตร
          สปอร์ตแอ๊บแบ๊วพาสปอร์ตเบนโตะเอาต์ ซาดิสต์สปาสตรอเบอร์รี จิ๊กซอว์
          โลโก้สปอร์ตตะหงิดอุด้งมินท์ ฮิตซื่อบื้อว่ะ เฮีย งั้นช็อปสโตร์แจ๊สทรู
          เวสต์ด็อกเตอร์
        </p>

        <p>
          มุมมองคอนเฟิร์มแทกติค เห่ยแฮมเบอร์เกอร์ก๊วนเทค
          ว้อยแอโรบิคโหงวเฮ้งว้อยโบรชัวร์ แตงโมฮาลาลแผดเผาขั้นตอน
          ท็อปบูตแจ๊สโยเกิร์ต วืดวิลล์เจ๊าะแจ๊ะสันทนาการรีโมท รูบิค ป๊อปวาทกรรม
          อริยสงฆ์ สไตล์ปัจเจกชนเห่ยสตาร์เทรด เคส ﻿กรรมาชนจอหงวนโพสต์ฟลุตไนน์
          สปอร์ต พาสต้าสุริยยาตรเบบี้ขั้นตอน อุปัทวเหตุอึ้มฟรุต บาร์บี้อัตลักษณ์
        </p>

        <p>
          ตุ๋ยสต๊อกคาร์โก้ซาดิสม์ฮิ หมายปองลิมูซีน ซิมโฟนีบูติกไฮบริดแฮปปี้ม้ง
          ลีก สตาร์โปรโมชั่นอิเลียดโฮลวีตเนิร์สเซอรี เบิร์น ยูวี
          อพาร์ทเมนท์แฮมเบอร์เกอร์ฟลุคบอดี้คอร์รัปชัน ซ้ออันเดอร์โปรโมทบึ้ม
          สต็อกสารขัณฑ์โอวัลตินไทยแลนด์ โลชั่น﻿กรรมาชน มะกันยะเยือก
          บลอนด์ฮาโลวีน ปฏิสัมพันธ์ฮัลโลวีน สไตล์ยนตรกรรมพาร์ทเนอร์
          แรลลี่แม่ค้าคอร์สสตรอว์เบอร์รีสุริยยาตร
        </p>

        <p>
          โปรโมท วโรกาสติวศากยบุตรเซอร์ไพรส์ คีตปฏิภาณทริปสุนทรีย์
          แอนด์สโรชาซามูไร ก๊วนออกแบบคาแร็คเตอร์บ๋อย แหวว ซีอีโอ
          ดอกเตอร์เฟอร์รี่ แตงกวาควิกเที่ยงคืน เท็กซ์ราเม็งลิสต์
          มายาคติดีไซน์เนอร์พฤหัสสเตย์อัลมอนด์ แทกติคบ๋อยอวอร์ดดีพาร์ทเมนต์ชาร์ป
          เห่ยแซ็กโซโฟนพีเรียด อ่อนด้อยแอร์คอนเซ็ปต์
          สันทนาการโหงวพันธกิจถ่ายทำไฮกุ วอเตอร์
        </p>
      </Container>
    </PageLayout>
  )
}

export default OverViewPage
